interThermalPhaseFoam/BubblySGS/BubblySGS_100/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//H is actually calculated automatically during operation, no need to do anything here, I guess...

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    BotWall
    {
        type            zeroGradient;
    }

    FreeStream
    {
        type            zeroGradient;
    }

    FrontNBack
    {
        type            empty;
    }

	LeftSide
	{
		type            symmetryPlane;
	}

	RightSide
	{
		type            symmetryPlane;
	}
}


// ************************************************************************* //
